In [29]:
import pandas as pd
import numpy as np

In [5]:
unames = ['user_id', 'gender', 'age', 'occupation', 'zip']
users = pd.read_table('ml-1m/users.dat', sep='::', header=None, names=unames, engine='python')

In [6]:
rnames = ['user_id', 'movie_id', 'rating', 'timestamp']
rating = pd.read_table('ml-1m/ratings.dat', sep="::", header=None, names=rnames, engine='python')

In [7]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('ml-1m/movies.dat', sep="::", header=None, names=mnames, engine='python')

In [13]:
users[:5]

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [14]:
rating[:5]

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [15]:
movies[:5]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

__**Perform joins**__
_____

In [16]:
data = pd.merge(pd.merge(rating, users), movies)
data[:5]

,user_id,movie_id,rating,timestamp,gender,age,occupation,zip,title,genres
0,1,1193,5,978300760,F,1,10,48067,One Flew Over the Cuckoo's Nest (1975),Drama
1,2,1193,5,978298413,M,56,16,70072,One Flew Over the Cuckoo's Nest (1975),Drama
2,12,1193,4,978220179,M,25,12,32793,One Flew Over the Cuckoo's Nest (1975),Drama
3,15,1193,4,978199279,M,25,7,22903,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,1193,5,978158471,M,50,1,95350,One Flew Over the Cuckoo's Nest (1975),Drama

In [17]:
mean_ratings = data.pivot_table('rating', index='title', columns='gender', aggfunc='mean')

In [18]:
mean_ratings[:5]

gender                                F         M
title
$1,000,000 Duck (1971)         3.375000  2.761905
'Night Mother (1986)           3.388889  3.352941
'Til There Was You (1997)      2.675676  2.733333
'burbs, The (1989)             2.793478  2.962085
...And Justice for All (1979)  3.828571  3.689024

### Assignment 1 - Objective 1 
** Data Exploration: Aggregate(sum) of movie rating for each genre **

In [30]:
# First interpretation of (Aggregate)

genre_ratings = data.pivot_table('rating', index='genres', aggfunc=np.sum)
genre_ratings.head()

                                               rating
genres
Action                                          41302
Action|Adventure                                38408
Action|Adventure|Animation                       1431
Action|Adventure|Animation|Children's|Fantasy     365
Action|Adventure|Animation|Horror|Sci-Fi         2192

In [31]:
# Second interpretation of the same question 

genre_ratings = data.pivot_table('rating', index='genres')
genre_ratings.head()

                                                 rating
genres
Action                                         3.354886
Action|Adventure                               3.676814
Action|Adventure|Animation                     4.147826
Action|Adventure|Animation|Children's|Fantasy  2.703704
Action|Adventure|Animation|Horror|Sci-Fi       3.546926

### Assignment 1 - Objective 2
** Data Exploration: The top 5 highest ranked genre by women **

In [37]:
mean_gender_rankings = data.pivot_table('rating', index='genres', columns='gender')
mean_gender_rankings.head()

gender                                                F         M
genres
Action                                         3.367474  3.352991
Action|Adventure                               3.701213  3.671115
Action|Adventure|Animation                     3.843750  4.217082
Action|Adventure|Animation|Children's|Fantasy  3.146341  2.510638
Action|Adventure|Animation|Horror|Sci-Fi       3.422535  3.563071

In [38]:
top_5_ranked_by_women = mean_gender_rankings.sort_values(by="F", ascending=False)[:5]
top_5_ranked_by_women

gender                                     F         M
genres
Animation|Comedy|Thriller           4.550802  4.445110
Animation                           4.533333  4.353107
Film-Noir|Romance|Thriller          4.448718  4.211073
Sci-Fi|War                          4.376623  4.464789
Adventure|Children's|Drama|Musical  4.355030  4.203138

### Assignment 1 - Objective 3
** Data Exploration: The top 5 highest ranked genre by men. **

In [40]:
top_5_ranked_men = mean_gender_rankings.sort_values(by="M", ascending=False)[:5]
top_5_ranked_men

gender                            F         M
genres
Sci-Fi|War                 4.376623  4.464789
Animation|Comedy|Thriller  4.550802  4.445110
Film-Noir|Mystery          4.319444  4.381536
Adventure|War              4.187970  4.376633
Animation                  4.533333  4.353107

### Assignment 1 - Objective 4
** Data Exploration: A breakdown of a movies ratings by age, use any movie of your choice. **

In [63]:
record = data.pivot_table('rating', index="title", columns="age", fill_value=0)[6:7]
record

age,1,18,25,35,45,50,56
title,,,,,,,
10 Things I Hate About You (1999),3.745455,3.41502,3.43295,3.102941,3.258065,3.62963,4.0

### Assignment 1 - Objective 5
** Data Exploration: A function that given a user id and movie id , returns a list of user ids for
other users that rated the movie identified by the provided movie id with the same score.. **

### Assignment 1 - Objective 6
** Data Exploration: Some other statistic, figure, aggregate, or plot that you created using this dataset,
along with a short description of what interesting observations you derived from it. **